# Pandas Tutorial 05
Updating Rows and Columns - Modifying Data

In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
df_new = pd.DataFrame(people)

In [4]:
df = pd.read_csv("/home/mostafiz/Python-Practice/Pandas/DataSet/developer_survey_2019/survey_results_public.csv")

df_schema = pd.read_csv("/home/mostafiz/Python-Practice/Pandas/DataSet/developer_survey_2019/survey_results_schema.csv")

In [5]:
df_new.columns #Command to get all the column names

Index(['first', 'last', 'email'], dtype='object')

# Want to rename all the column names

In [6]:
df_new.columns = ['First_Name', 'Last_Name', 'Email_Address']

In [7]:
df_new

  First_Name Last_Name            Email_Address
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

# Lets make the colum names uppercase
We will use list comprehension here

In [8]:
df_new.columns = [x.upper() for x in df_new.columns]

In [9]:
df_new

  FIRST_NAME LAST_NAME            EMAIL_ADDRESS
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [10]:
# Make the column list lower
df_new.columns = [x.lower() for x in df_new.columns]

In [11]:
df_new

  first_name last_name            email_address
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

# Use replace method

In [12]:
df_new.columns = df_new.columns.str.replace('_','')

In [13]:
df_new

  firstname lastname             emailaddress
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@email.com
2      John      Doe        JohnDoe@email.com

# rename() method to rename the column
we need to use dictionary here

In [14]:
df_new.rename(columns={'firstname' : 'FirstName',
                      'lastname' : 'LastName',
                      'emailaddress' : 'EmailAddress'})

  FirstName LastName             EmailAddress
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@email.com
2      John      Doe        JohnDoe@email.com

In [15]:
df_new

  firstname lastname             emailaddress
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@email.com
2      John      Doe        JohnDoe@email.com

# But rename method change it permanently
we must use inplace=True in the method

In [16]:
df_new.rename(columns={'firstname' : 'FirstName',
                      'lastname' : 'LastName',
                      'emailaddress' : 'EmailAddress'}, inplace = True)

In [17]:
df_new

  FirstName LastName             EmailAddress
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@email.com
2      John      Doe        JohnDoe@email.com

# Updating values

In [18]:
# Lets update our first record 
df_new.loc[0]

FirstName                         Corey
LastName                        Schafer
EmailAddress    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [19]:
df_new.loc[0] = ['Mostafiz', 'Rahman', 'MostafizRahman@email.com'] #Just passing a list

In [20]:
df_new

  FirstName LastName              EmailAddress
0  Mostafiz   Rahman  MostafizRahman@email.com
1      Jane      Doe         JaneDoe@email.com
2      John      Doe         JohnDoe@email.com

# What if you have lots of columns and you want to edit few of them?

In [21]:
# Let say I will update lastname and email values for first record
# Changing more than one value, so we must use a list
df_new.loc[0, ['LastName', 'EmailAddress']] = ['Hassan', 'mostafizur@email.com']

In [22]:
df_new

  FirstName LastName          EmailAddress
0  Mostafiz   Hassan  mostafizur@email.com
1      Jane      Doe     JaneDoe@email.com
2      John      Doe     JohnDoe@email.com

In [23]:
# If you want to change a single value, no need to use list
df_new.loc[0, 'EmailAddress'] = 'hassan_mostafiz@email.com'

In [24]:
df_new

  FirstName LastName               EmailAddress
0  Mostafiz   Hassan  hassan_mostafiz@email.com
1      Jane      Doe          JaneDoe@email.com
2      John      Doe          JohnDoe@email.com

In [25]:
# Instead .loc, you can use .at as well. Results are same
df_new.loc[0, 'EmailAddress'] = 'hassan_mostafiz@gmail.com.com'

In [26]:
df_new

  FirstName LastName                   EmailAddress
0  Mostafiz   Hassan  hassan_mostafiz@gmail.com.com
1      Jane      Doe              JaneDoe@email.com
2      John      Doe              JohnDoe@email.com

# appy(), #map(), #applymap(), #replace

In [27]:
# apply - work on dataframe or series of object
# series - for every value[anytime we use column name]
df_new['EmailAddress'].apply(len)

0    29
1    17
2    17
Name: EmailAddress, dtype: int64

In [28]:
def update_email(EmailAddress):
    return EmailAddress.upper()

In [29]:
df_new['EmailAddress'].apply(update_email)

0    HASSAN_MOSTAFIZ@GMAIL.COM.COM
1                JANEDOE@EMAIL.COM
2                JOHNDOE@EMAIL.COM
Name: EmailAddress, dtype: object

In [30]:
df_new

  FirstName LastName                   EmailAddress
0  Mostafiz   Hassan  hassan_mostafiz@gmail.com.com
1      Jane      Doe              JaneDoe@email.com
2      John      Doe              JohnDoe@email.com

# Want to do it permanently?

In [31]:
df_new['EmailAddress'] = df_new['EmailAddress'].apply(update_email)

In [32]:
df_new

  FirstName LastName                   EmailAddress
0  Mostafiz   Hassan  HASSAN_MOSTAFIZ@GMAIL.COM.COM
1      Jane      Doe              JANEDOE@EMAIL.COM
2      John      Doe              JOHNDOE@EMAIL.COM

# We can use lamda function as well.

In [33]:
df_new['EmailAddress'] = df_new['EmailAddress'].apply(lambda x: x.lower() ) #x is the argument we are passing

In [34]:
df_new

  FirstName LastName                   EmailAddress
0  Mostafiz   Hassan  hassan_mostafiz@gmail.com.com
1      Jane      Doe              janedoe@email.com
2      John      Doe              johndoe@email.com

In [35]:
# Apply on dataframe 
# We we apply on datagframe, it applies on each row or column of that dataframe 
df_new['EmailAddress'].apply(len)

0    29
1    17
2    17
Name: EmailAddress, dtype: int64

In [36]:
df_new.apply(len)

FirstName       3
LastName        3
EmailAddress    3
dtype: int64

The apply method is applied on each column. From the above example 
we have 3 records under FirstName, LastName and EmailAddress each

In [37]:
len(df_new['EmailAddress'])# 3 records under EmailAddress

3

In [38]:
df_new.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

The above example shows that like:
record 0 (1st rewcord three values FirstName, LastName and EmailAddress
and so on for record 1 and record 2

# min attribute - gives the minimum value

In [39]:
#We have dataset having all string values. So here min will give us the alphabetical order minimum
df_new.apply(pd.Series.min)

FirstName                                Jane
LastName                                  Doe
EmailAddress    hassan_mostafiz@gmail.com.com
dtype: object

# Apply on individual value on dataframe ... applymap()
It doe not work for series

In [40]:
df_new.applymap(len)

   FirstName  LastName  EmailAddress
0          8         6            29
1          4         3            17
2          4         3            17

In [41]:
#Making all values lowercase
df_new.applymap(str.lower)

  FirstName LastName                   EmailAddress
0  mostafiz   hassan  hassan_mostafiz@gmail.com.com
1      jane      doe              janedoe@email.com
2      john      doe              johndoe@email.com

# map() - only works on the series
map is used to substitute values in series

In [42]:
df_new['FirstName'].map({'Mostafiz':'Shakib', 'Jane':'Khan'})

0    Shakib
1      Khan
2       NaN
Name: FirstName, dtype: object

upppsss..NAN value

# replace () will work better

In [43]:
df_new['FirstName'].replace({'Mostafiz':'Shakib', 'Jane':'Khan'})

0    Shakib
1      Khan
2      John
Name: FirstName, dtype: object

In [44]:
df_new

  FirstName LastName                   EmailAddress
0  Mostafiz   Hassan  hassan_mostafiz@gmail.com.com
1      Jane      Doe              janedoe@email.com
2      John      Doe              johndoe@email.com

uppsss -- did not change

In [45]:
df_new['FirstName'] = df_new['FirstName'].replace({'Mostafiz':'Shakib', 'Jane':'Khan'})

In [46]:
df_new

  FirstName LastName                   EmailAddress
0    Shakib   Hassan  hassan_mostafiz@gmail.com.com
1      Khan      Doe              janedoe@email.com
2      John      Doe              johndoe@email.com

In [47]:
df.rename(columns = {'ConvertedComp':'SalaryUSD'}, inplace=True)

In [48]:
df

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
0,1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
1,2,I am a student who is learning to code,No,Less than once per year,The quality of OSS and closed source software ...,"Not employed, but looking for work",Bosnia and Herzegovina,"Yes, full-time","Secondary school (e.g. American high school, G...",NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,19.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
2,3,"I am not primarily a developer, but I write co...",Yes,Never,The quality of OSS and closed source software ...,Employed full-time,Thailand,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)",Web development or web design,...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,28.0,Man,No,Straight / Heterosexual,NaN,Yes,Appropriate in length,Neither easy nor difficult
3,4,I am a developer by profession,No,Never,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,22.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
4,5,I am a developer by profession,Yes,Once a month or more often,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,Ukraine,No,"Bachelor’s degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,30.0,Man,No,Straight / Heterosexual,White or of European descent;Multiracial,No,Appropriate in length,Easy
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88878,88377,NaN,Yes,Less than once a month but more than once per ...,The quality of OSS and closed source software ...,"Not employed, and not looking for work",Canada,No,Primary/elementary school,NaN,...,NaN,Tech articles written by other developers;Tech...,NaN,Man,No,NaN,NaN,No,Appropriate in length,Easy
88879,88601,NaN,No,Never,The quality of OSS and closed source software ...,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88880,88802,NaN,No,Never,NaN,Employed full-time,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88881,88816,NaN,No,Never,"OSS is, on average, of HIGHER quality than pro...","Independent contractor, freelancer, or self-em...",NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
88882,88863,NaN,Yes,Less than once per year,"OSS is, on average, of HIGHER quality than pro...","Not employed, and not looking for work",Spain,"Yes, full-time","Professional degree (JD, MD, etc.)","Computer science, computer engineering, or sof...",...,Somewhat less welcome now than last year,Tech articles written by other developers;Indu...,18.0,Man,No,Straight / Heterosexual,Hispanic or Latino/Latina;White or of European...,No,Appropriate in length,Easy

In [49]:
#Check it
df['SalaryUSD']

0            NaN
1            NaN
2         8820.0
3        61000.0
4            NaN
          ...
88878        NaN
88879        NaN
88880        NaN
88881        NaN
88882        NaN
Name: SalaryUSD, Length: 88883, dtype: float64

In [50]:
df['Hobbyist']

0        Yes
1         No
2        Yes
3         No
4        Yes
        ...
88878    Yes
88879     No
88880     No
88881     No
88882    Yes
Name: Hobbyist, Length: 88883, dtype: object

In [51]:
#Lets do some magic. Lets check Hobbyist column -- Yes and No value.
#We will convert these Yes - True, No - False
#map()
df['Hobbyist'].map({'Yes': True, 'No': False})

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: bool

In [52]:
df['Hobbyist']

0        Yes
1         No
2        Yes
3         No
4        Yes
        ...
88878    Yes
88879     No
88880     No
88881     No
88882    Yes
Name: Hobbyist, Length: 88883, dtype: object

In [54]:
df['Hobbyist'] = df['Hobbyist'].replace({'Yes': True, 'No': False})

In [55]:
df['Hobbyist']

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: bool